[{"category":"food","line":"Baby if you were a burger at McDonalds you would be a McGorgeous."},{"category":"food","line":"Let me be a chicken nugget and take a dip in your sauce."},{"category":"food","line":"Now what's on the menu? Me-n-u"},{"category":"food","line":"Omelette you in on a secret. You and I would brie perfectly gouda."},{"category":"food","line":"Can I double stuff your Oreo?"},{"category":"food","line":"I do not fancy wines, I prefer moans."},{"category":"food","line":"I like my women like I like my doughnuts - HOT and HOLY!"},{"category":"food","line":"Do you like Alphabet soup? Cause you gonna be choking on the D"},{"category":"food","line":"I like my women like I like my ice cream, fat free and dripping down my fingers."},{"category":"food","line":"Do you like Krispy Kreme? Cause I wanna glaze your donut."},{"category":"food","line":"Do you like hot dogs girl? Cause I'd like to put my weiner between those buns"},{"category":"food","line":"I want you more then a Hagen-Daas on a hot summer day."},{"category":"food","line":"You must work at subway, because you’re giving me a foot long."},{"category":"cheesy","line":"Can I hit you in the face... with my lips?"},{"category":"cheesy","line":"You may fall from the sky, you may fall from a tree, but the best way to fall... is in love with me."},{"category":"cheesy","line":"When I first saw you, I knew we could win the Stanley Cup in tonsil hockey."},{"category":"cheesy","line":"My name isn't Elmo, but you can tickle me any time you want to.Can you take me to the doctor? Because I just broke my leg falling for you.You must be a ninja, because you snuck into my heartI need a dollar, but I only have 90 cents... do you want to be my dime?[Look at her shirt label.] When they say, \"What are you doing?\" You respond: \"Yep! Made in heaven!\"Be unique and different, say yes.Your eyes are blue, like the ocean. And baby, I'm lost at sea.You know how they say skin is the largest organ on the human body? Not in my case."},{"category":"cheesy","line":"My lips are like skittles. Wanna taste the rainbow?"},{"category":"cheesy","line":"They say dating is a numbers game... so can I get your number?"},{"category":"cheesy","line":"You be the Dairy Queen and I'll be your Burger King: You treat me right, and I'll do it your way."},{"category":"cheesy","line":"(Ask a person for the time) 9:15? So today is May 1, 2008, at 9:15 PM, thanks I just wanted to be able to remember the exact moment that I met the woman of my dreams."},{"category":"cheesy","line":"Pinch me. [Why?] You're so fine I must be dreaming.If I had to choose between breathing or loving you, I would say \"I love you\" with my last breath!Ouch! My tooth hurts! [Why?] Because you are soooo sweet!I'm not trying to impress you or anything, but... I'm Batman!You must be from Pearl Harbor, because baby, you're the bomb.You must be Jamaican, because Jamaican me crazy.Do you know karate? Because your body is really kickin'.You must be a high test score, because I want to take you home and show you to my mother.I’m learning about important dates in history class. Wanna be one of them?I hear they banned you from school lunches for being so sweet.I need some answers for my math homework. Quick. What’s your number?Are you a Snickers bar? Cause you satisfy me.Is your last name Campbell? Cause you're \"mmmm... good!\"You're like a dictionary, you add meaning to my life!Baby, you are so fine I could put you on a plate and sop you up with a biscuit."},{"category":"cheesy","line":"Is there a rainbow today? Because I just found the treasure I've been searching for!You remind me of a magnet, because you sure are attracting me over here!Hey, is it just me, or are we destined to be married?Hello. Are you taking any applications for a boy\/girlfriend?I have an \"owie\" on my lip. Will you kiss it and make it better?"},{"category":"cheesy","line":"Let's make like a fabric softener and 'Snuggle"},{"category":"cheesy","line":"Hi, my name is Doug. That's \"god\" spelled backwards with a little bit of you wrapped up in it.If I could reach out and hold a star for everytime you've made me smile, I'd hold the sky in the palm of my hand.Well, here I am. What were your other two wishes?(Put your fingers on the other's nipples) Hey, here's (name), comin' at you with the weather. Can I be your warm front?How much does a polar bear weigh? [How much?] Enough to break the ice... Hi, I'm (insert name here)."},{"category":"cheesy","line":"Well, I AM telepathic, and I can tell that you love me. Right? [NO!] Darn, I always get \"love\" and \"lust\" mixed up."},{"category":"cheesy","line":"Should I smile because we are friends, or cry because I know that is what we will ever be?When I look into your eyes, it is like a gateway into the world of which I want to be a part."},{"category":"cheesy","line":"Hey baby. You got a jersey? [A jersey?...Why?] Because I need your name and number."},{"category":"cheesy","line":"You’re so cute it’s distracting!"},{"category":"cheesy","line":"Hello, I'm doing a survey of what people think are the cheesiest pickup lines. So, do you pick 'Do you come here often?', 'What's your sign?', or 'Hello, I'm doing a survey of what people think are the cheesiest pickup lines.'?(hold out hand) Would you hold this for me while I go for a walk?This time next year let’s be laughing together.Is your last name Whitman, because I want to sample you.On a scale of 1 to 10, you're a 9. I'm the 1 you need.Hey baby, I must be a light switch, cuz every time I see you, you turn me on!Are you a beaver? Cause daaaaam!I hope your day has been as beautiful as you are."},{"category":"cheesy","line":"Is your father Little Caesar? Cause you look Hot 'n Ready."},{"category":"cheesy","line":"If you were a chicken, you'd be impeccable."},{"category":"cheesy","line":"I could use some spare change and you're a dime.I'm no mathematician, but I'm pretty good with numbers. Tell you what, Give me yours and watch what I can do with it.Didn't I see you on the cover of Vogue?Excuse me, I don't want you to think I'm ridiculous or anything, but you are the most beautiful woman I have ever seen. I just felt like I had to tell you.Have you always been this cute, or did you have to work at it?Hey, don't I know you? Yeah, you're the girl with the beautiful smile."},{"category":"cheesy","line":"Is your father a mechanic? Because you’ve got a finely tuned body!"},{"category":"cheesy","line":"I have had a really bad day and it always makes me feel better to see a pretty girl smile. So, would you smile for me?I hope you know CPR, because you take my breath away!I just had to come talk with you. Sweetness is my weakness.I think I can die happy now, cause I've just seen a piece of heaven.Apart from being sexy, what do you do for a living?I sneezed because God blessed me with you.Is it hot in here or is it just you?Nice to meet you, I'm (your name) and you are...gorgeous!I may not be a genie, but I can make all your wishes come true!"},{"category":"cheesy","line":"Was your dad king for a day? He must have been to make a princess like you."},{"category":"cheesy","line":"Were you arrested earlier? It's gotta be illegal to look that good."},{"category":"cheesy","line":"Were your parents Greek Gods, 'cause it takes two gods to make a goddess.What does it feel like to be the most beautiful girl in this room?What's that on your face? Oh, must just be beauty. Here, let me get it off. Hey, it's not coming off!"},{"category":"cheesy","line":"I blame you for global warming... your hotness is too much for the planet to handle!You are the reason men fall in love.You know the more I drink, the prettier you get!You know, I would die happy if I saw you naked just once!You better call Life Alert, 'cause I've fallen for you and I can't get up.You're single. I'm single. Coincidence? I think not.You know, you might be asked to leave soon. You're making the other women look really bad.You look like my third wife. [how many time have you been married?] Twice.You make me melt like hot fudge on a sundae.You should be someone's wife.Were you in Boy Scouts? Because you sure have tied my heart in a knot.Are you as beautiful on the inside as you are on the outside?I want to be your tear drop, so I could be born in your eyes, live on your cheeks, and die on your lips."},{"category":"cheesy","line":"I know where they give out free drinks... it’s a place called “My House”!"},{"category":"cheesy","line":"I can't think of anyone else I’d rather survive a Zombie Apocalypse with."},{"category":"cheesy","line":"Babe! you look so fine I could drink your bath water!If I had a rose for every time I thought of you, I would be walking through my garden forever.Girl, if I were a fly, I'd be all over you, because you're the shit!Hey, how did you do that? (What?) Look so good?Damn girl, you have more curves than a race track.If you stood in front of a mirror and help up 11 roses, you would see 12 of the most beautiful things in the world.You are so beautiful that I would marry your brother just to get into your family.You look like a cool glass of refreshing water, and I am the thirstiest man in the world.Are you a tamale? 'Cause you're hot.You are so beautiful that you give the sun a reason to shine.Do you bleach your teeth? 'Cause your smile lights up the entire room like a candle in the dark. Let's go prove it.Your ass is so nice that it is a shame that you have to sit on it.Someone should call the police, because you just stole my heart!Stop, drop, and roll, baby. You are on fire.Baby, you're so hot, you make the equator look like the north pole.Come live in my heart, and pay no rent.You're hotter than Papa Bear's porridge.I hope there's a fire truck nearby, cause you're smokin'!If it weren't for that DAMNED sun, you'd be the hottest thing ever created."},{"category":"cheesy","line":"How is your fever? [What fever?] Oh... you just look hot to me."},{"category":"cheesy","line":"Tonight this Han doesn’t want to fly Solo."},{"category":"cheesy","line":"I just got dumped, and I think that you could make me feel better."},{"category":"cheesy","line":"(Walk up to someone and bite them anywhere) Sorry, taking a bite out of crime. [WHAT?] Well it has to be illegal to look that good!You are a 9 - you'd be a perfect 10 if you were with me."},{"category":"cheesy","line":"Excuse me, I'd like to have kids someday, and I wanted to know how your parents created such a beautiful creature."},{"category":"cheesy","line":"You’re my favorite weakness."},{"category":"cheesy","line":"You're so hot, I bet you could light a candle at 10 paces.I can't believe I've been hear the entire evening with all these beautiful people and the moment I find 'The One', all I have time to say is \"good bye\"."},{"category":"cheesy","line":"Hey baby, you've got something on your butt - my eyes!"},{"category":"cheesy","line":"This isn't a beer belly, It's a fuel tank for a love machine."},{"category":"cheesy","line":"Baby you make palms sweaty, knees weak, arms spaghetti."},{"category":"cheesy","line":"If I was an octopus, all my 3 hearts would beat for you﻿."},{"category":"cheesy","line":"Guess what I’m wearing? The smile you gave me!"},{"category":"cheesy","line":"I don't know you, but I think I love you already."},{"category":"cheesy","line":"Here's the key to my house, my car... and my heart."},{"category":"cheesy","line":"If we shared a garden, I'd put my tulips and your tulips together. (tulips = two lips)Is your name Summer? 'Cause you are as hot as hell.If I had to choose between one night with you or winning the lottery...I would chose winning the lottery...but it would be close...real close...Do you have any sunscreen? 'Cause you are burning me up!"},{"category":"cheesy","line":"See these keys? I wish I had the one to your heart."},{"category":"cheesy","line":"You're hotter than donut grease."},{"category":"cheesy","line":"Your eyes are as blue as window cleaner.Was that an earthquake or did you just rock my world?If you were a burger at McDonalds, you'd be McGorgeous.Are your parents retarded, 'cause you sure are special.If you could put a price tag on beauty you'd be worth more than Fort Knox.I must be dancing with the devil, because you're hot as hell.Are you the moon? Because even when it's dark, you still seem to shine."},{"category":"cheesy","line":"Roses are red, my face is too, that only happens when I’m around you."},{"category":"cheesy","line":"Roses are red, I have a crush, whenever I’m around you, all I do is blush."},{"category":"cheesy","line":"I never need to see the sun again because your eyes light up my world."},{"category":"cheesy","line":"How much does it cost to date you? Cause damn, you look expensive!"},{"category":"cheesy","line":"If you were a steak you would be well done.It's dark in here. Wait! It's because all of the light is shining on you.Your hand looks heavy. Let me hold it for you.Do you have any raisins? [No] How about a date?"},{"category":"cheesy","line":"Are you a kidnapper? Because you just abducted my heart."},{"category":"cheesy","line":"Is your name Katrina? [No, why?] 'Cuz baby, you rock me like a hurricane!Can you pull this heart-shaped arrow out of my butt? A damn little kid with wings shot me.On The PhoneShe\/He says: \"Hold on\"You Say: \"Sorry, I can't hold on... I've already fallen for you.\"Is your body from McDonald's? Cause I'm lovin' it!Are you a microwave oven? Cause you melt my heart.Did you get your license suspended for driving so many guys crazy?Are you a girl scout, cause you tie my heart in knots.You're so hot, I could bake cookies on you.You look beautiful today, just like every other day.Let's play Winnie the Pooh and get my nose stuck in your honey jar."},{"category":"cheesy","line":"When I'm older, I'll look back at all of my crowning memories, and I'll think of the day my children were born, the day I got married, and the day that I met you.If beauty were time, you'd be eternity."},{"category":"cheesy","line":"Is your car battery dead? Because I'd like to jump you."},{"category":"cheesy","line":"I'm lost. Can you tell me which road leads to your heart?"},{"category":"cheesy","line":"Where do you hide your wings?"},{"category":"cheesy","line":"Is your name Mickey? Because you’re so FINE!"},{"category":"cheesy","line":"Are you made of grapes? Cause you’re fine as wine."},{"category":"cheesy","line":"For a moment I thought I had died and gone to heaven. Now I see that I am very much alive, and heaven has been brought to me."},{"category":"cheesy","line":"Forget about Spiderman, Superman, and Batman. I'll be your man."},{"category":"cheesy","line":"There isn't a word in the dictionary for how good you look."},{"category":"cheesy","line":"Girl, you’re like Mastercard - absolutely priceless."},{"category":"cheesy","line":"Fascinating. I've been looking at your eyes all night long, 'cause I've never seen such dark eyes with so much light in them."},{"category":"cheesy","line":"You're the only girl I love now... but in ten years, I'll love another girl. She'll call you 'Mommy.'"},{"category":"cheesy","line":"My doctor says I'm lacking Vitamin U."},{"category":"cheesy","line":"I tried my best to not feel anything for you. Guess what? I failed."},{"category":"cheesy","line":"Hey, don't frown. You never know who could be falling in love with your smile."},{"category":"cheesy","line":"Because of you, I laugh a little harder, cry a little less, and smile a lot more."},{"category":"cheesy","line":"Excuse me, but does this smell like chloroform to you?"},{"category":"cheesy","line":"Most people like to watch the Olympics, because they only happen once every 4 years, but I'd rather talk to you cause the chance of meeting someone so special only happens once in a lifetime."},{"category":"cheesy","line":"Can I have directions? [To where?] To your heart."},{"category":"cheesy","line":"I'm sorry, I don't think we've met. I wouldn't forget a pretty face like that."},{"category":"cheesy","line":"Your body is 65% water and I'm thirsty."},{"category":"cheesy","line":"There are people who say Disneyland is the happiest place on earth. Apparently, none of them have ever been in your arms."},{"category":"cheesy","line":"Does your left eye hurt? Because you've been looking right all day."},{"category":"cheesy","line":"My buddies bet me that I wouldn't be able to start a conversation with the most beautiful girl in the bar. Wanna buy some drinks with their money?"},{"category":"cheesy","line":"Do you have a name or can I just call you mine?"},{"category":"cheesy","line":"With my IQ and your body, we could make a race of superchildren and conquer the earth!"},{"category":"cheesy","line":"I will stop loving you when an apple grows from a mango tree on the 30th of February."},{"category":"cheesy","line":"If I were a stop light, I'd turn red everytime you passed by, just so I could stare at you a bit longer."},{"category":"cheesy","line":"Let's make like the Olympic rings and hook up later."},{"category":"cheesy","line":"Your body is a wonderland, and I'd like to be Alice."},{"category":"cheesy","line":"It's a good thing I wore gloves today. Otherwise you'd be too hot to handle.Hello. Cupid called. He says to tell you that he needs my heart back."},{"category":"musician","line":"Good boys deserve more than just fudge."},{"category":"musician","line":"Girl, you give me a tromboner."},{"category":"musician","line":"Save a drum, bang a drummer."},{"category":"musician","line":"This reed isn't the only thing I can get wet."},{"category":"musician","line":"That's a nice set of mallets you have."},{"category":"musician","line":"Damn girl, you're lookin' sharp!"},{"category":"musician","line":"I'd love to strum your g-string"},{"category":"musician","line":"I just lost my job and may be Baroque, but that doesn't mean I can't show you a good time."},{"category":"musician","line":"Perhaps you and your friend would like to play a trio with me?"},{"category":"musician","line":"The pads on my MPC2000XL aren't the only thing I'll be banging tonight."},{"category":"musician","line":"My embouchure is good for more than just playing the trumpet, if you know what I mean."},{"category":"musician","line":"I bet that flute isn't the only thing you know how to blow."},{"category":"musician","line":"Slow down girl, you're giving me a woodwind."},{"category":"musician","line":"You wanna grease my slide?"},{"category":"musician","line":"You must be a fourth or a fifth, because you're just perfect!"},{"category":"musician","line":"I bet we'd get into some serious Treble together."},{"category":"musician","line":"Call me AC\/DC, because I'm gonna rock you all night long!"},{"category":"musician","line":"The Proclaimers would walk 500 miles to \"come back home to you,\" but I'll do you one better. I'll sit through an entire Nickelback concert."},{"category":"musician","line":"Let's play a love game. I'll be Alejandro, you be Lady Gaga and I'll let you take a ride on my disco stick."},{"category":"musician","line":"Composers always score."},{"category":"engineering","line":"Can I do your Systems Analysis?"},{"category":"engineering","line":"Are you a piece of carbon? Because I would love to date you."},{"category":"engineering","line":"Let's take each other to the limit to see if we converge."},{"category":"engineering","line":"I'd like to demonstrate with you simple harmonic motion."},{"category":"engineering","line":"The volume of a generalized cylinder has been known for thousands of years, but you won't know the volume of mine until tonight."},{"category":"engineering","line":"Why don't we measure the coefficient of static friction between me and you?"},{"category":"engineering","line":"Isn't your e-mail address beautifulgirl@mydreams.com?"},{"category":"engineering","line":"Can I see your blueprints? I want to lay some pipe in you and need to know that you’re structurally sound enough to do so."},{"category":"engineering","line":"That dress would look even better accelerating towards my bedroom floor at 9.8 m\/s^2"},{"category":"engineering","line":"I like the area bounded by your two curves."},{"category":"engineering","line":"Girl when I see that body of yours it creates a stress on my heart and a strain on my \"beam\"."},{"category":"engineering","line":"Has anyone ever called you FAT? They were dead-wrong! You are NTFS, obviously."},{"category":"engineering","line":"Hey Baby, wanna come back to my lab and work with my microprocessor?"},{"category":"engineering","line":"My love for you is a monotonically increasing unbounded function."},{"category":"engineering","line":"Life without you is like dereferencing a NULL pointer."},{"category":"bad","line":"Let’s face it. I’m hot, you’re hot and we both know you got a crush on me."},{"category":"bad","line":"Be unique and different, just say yes."},{"category":"bad","line":"Girl, I hope you have a license, cause you’re driving me crazy"},{"category":"bad","line":"I'm gay but you might just turn me straight."},{"category":"bad","line":"You must be from Tennessee! Because you’re the only TEN I see!"},{"category":"bad","line":"Is that a tic-tac in your blouse or are you just glad to see me?"},{"category":"bad","line":"Hey, somebody farted. Lets get out of here!"},{"category":"bad","line":"You've got the whitest teeth I have ever seen!"},{"category":"bad","line":"Are you Swedish? Because you're the sweetish girl I've met!"},{"category":"bad","line":"I'm not drunk, I'm just intoxicated by you."},{"category":"bad","line":"Are those space pants? Because your butt is out of this world!"},{"category":"bad","line":"If beauty were measured in seconds, you'd be an hour!"},{"category":"bad","line":"Hey honey, I got money!"},{"category":"bad","line":"My name is Peter Pan, because I can take you to Never Never Land."},{"category":"bad","line":"What does it feel like to be the most beautiful girl in this room?"},{"category":"computer","line":"If you ever need to get rid of a trojan, don't hesitate to call me!"},{"category":"computer","line":"You're making me feel like I have something in common with these pop-up ads."},{"category":"computer","line":"What's the difference between a crush and a Facebook account? [what?] I'm not rapidly developing a Facebook account on you."},{"category":"computer","line":"I need to hop over to Facebook for a second to change my status to smitten."},{"category":"computer","line":"What do you say we play a game of \"Words With More Than Friends?"},{"category":"computer","line":"Roses are #ff0000, violets are #0000ff, all my base are belong to you."},{"category":"computer","line":"Need me to unzip your files?"},{"category":"computer","line":"Are your pants a compressed file? Because I'd love to unzip them!"},{"category":"computer","line":"I googled your name earlier... I clicked on 'I'm Feeling Lucky.'"},{"category":"computer","line":"How about we go home and you handle my exception?"},{"category":"computer","line":"If we were connected on Linkedin, I'd endorse you all night long."},{"category":"computer","line":"I wish you were Broadband, so I could get high-speed access."},{"category":"computer","line":"Girl, you are hotter than the bottom of my laptop."},{"category":"computer","line":"I'd ask if you come here often, but I already stalk you on FourSquare."},{"category":"computer","line":"Can I do a penetration test on your back door?"},{"category":"computer","line":"Can you put a Trojan on my Hard Drive?"},{"category":"computer","line":"Hey girl, can you sit on my laptop?"},{"category":"computer","line":"Can I stick my flash drive in your USB port?"},{"category":"computer","line":"Computer techs have skilled fingers if you know what I mean."},{"category":"valentinesday","line":"Please see our huge collection of Cheesy Pick Up Lines!"},{"category":"valentinesday","line":"I'm sorry I didn't get you chocolates for Valentine's Day, but if you want something sweet I'm right here."},{"category":"valentinesday","line":"Once you go cupid, the rest are just stupid!"},{"category":"valentinesday","line":"Baby you’re so sweet you’d put Hershey's out of business!"},{"category":"valentinesday","line":"I bought you 12 roses for Valentine's Day - 11 real and 1 fake. I will love you until all of them die and wilt away."},{"category":"valentinesday","line":"Do you believe in love at first sight, or should I tell Cupid to shoot you with that arrow one more time?"},{"category":"valentinesday","line":"Hello, Cupid called... he says to tell you that he needs my heart back."},{"category":"valentinesday","line":"You break my heart into 15 unique, chewable pieces... just like a Whitman's Sampler."},{"category":"valentinesday","line":"Going on a date with me is WAY better than eating a bag of those weird, chalky heart candies with sayings on them."},{"category":"valentinesday","line":"The only sweet thing I want for Valentine's Day is a cutie pie like you!"},{"category":"valentinesday","line":"Can I have a kiss on the cheek? I want to be able to say a gorgeous girl kissed me on Valentine's Day."},{"category":"valentinesday","line":"Be mine because you're fine."},{"category":"valentinesday","line":"Do you like cats? Because I'd like you to take meowt for Valentine's Day."},{"category":"valentinesday","line":"I'll be your \"alentine\" for now, you'll need to give me the \"V\" after dinner."},{"category":"valentinesday","line":"I was going to get you a box of chocolates, but you already have a sweeter box."},{"category":"valentinesday","line":"When I look at you, I see more stars than the cast list in that Valentine's Day movie."},{"category":"animal","line":"If you were a camel, I'd hump you!"},{"category":"animal","line":"Wanna go on a picnic? Alpaca lunch."},{"category":"animal","line":"Are you a unicorn? Because you’re my fantasy"},{"category":"animal","line":"Are you a termite? Cause you're about to have a mouth full of wood."},{"category":"animal","line":"Do you have pet insurance? Because I'm going destroy your pussy."},{"category":"animal","line":"I'll have the chicken breast, hold the chicken."},{"category":"animal","line":"Baby, you're like a championship bass. I don't know whether to mount you or eat you!"},{"category":"animal","line":"It's hunting season and fox like you shouldn’t be out in the open!"},{"category":"animal","line":"If you were a farmer I would let you choke my chicken"},{"category":"animal","line":"Have you ever milked a cow before? cause your gonna need a bucket for this too."},{"category":"animal","line":"Life's a jungle - let's go to your place and bang like animals!"},{"category":"animal","line":"If I were a dog would you help me bury my bone?"},{"category":"tinder","line":"Are you the SAT? Cause I’d do you for 3 hours and 45 minutes, with a ten minute break in the middle for snacks."},{"category":"tinder","line":"What’s a smart, attractive, young man like myself doing without your number?"},{"category":"tinder","line":"Want to come over to my place and watch porn on my flat screen mirror?"},{"category":"tinder","line":"Do you mix concrete for a living? Because you're making me hard."},{"category":"tinder","line":"Judging by your hair, you seem like a girl who likes to do anal."},{"category":"tinder","line":"Do you like Nintendo? Cause Wii would look good together."},{"category":"tinder","line":"Sit on my face and I’ll eat my way to your heart."},{"category":"tinder","line":""},{"category":"tinder","line":"You’re the type of girl I’d let sit on my face for a long period of time."},{"category":"tinder","line":"What are the chances I see you naked tonight?"},{"category":"tinder","line":"If I were a watermelon, would you spit or swallow my seeds?"},{"category":"tinder","line":"On a scale of 1 to America, how free are you tonight?"},{"category":"tinder","line":"You’re coming over tonight to watch Game of Thrones and make out."},{"category":"tinder","line":"YOU. NUMBER. NOW."},{"category":"tinder","line":"Before I hit on you, do you have a problem with large genitalia?"},{"category":"tinder","line":"Did you grow up on a chicken farm? 'Cause you sure know how to raise a cock. "},{"category":"tinder","line":"I could’ve called heaven and asked for an angel, but I was hoping you’re a slut instead."},{"category":"tinder","line":"You wanna know what's beautiful? Read the first word again."},{"category":"tinder","line":"Be unique and different, say yes."},{"category":"tinder","line":"I'm no Fred Flintstone, but I can make your Bedrock!"},{"category":"tinder","line":"You’re not a vegan, are you? Because I’d love to meat you."},{"category":"tinder","line":"No wonder the sky is grey today, all the blue is in your eyes."},{"category":"tinder","line":"Did you have lucky charms for breakfast? Because you look magically delicious!"},{"category":"tinder","line":"If a thousand painters worked for a thousand years, they could not create a work of art as beautiful as you."},{"category":"tinder","line":"Are you African? Because you're a frican babe."},{"category":"tinder","line":"Did you sit in a pile of sugar? Cause you have a pretty sweet ass."},{"category":"tinder","line":"Do you like Pizza Hut? Cause I'll stuff your crust."},{"category":"tinder","line":"Are you from China? Cause I'm China get in your pants."},{"category":"tinder","line":"Are you Jewish? Cause the way you're looking at me, I'm beginning to think Jewish this dick was in your mouth."},{"category":"tinder","line":"That's a nice shirt. Can I try it on after we have sex?"},{"category":"tinder","line":"I would absolutely love to swap bodily fluids with you."},{"category":"tinder","line":"Is your name Daisy? Because I have a sudden urge to plant you right here!"},{"category":"tinder","line":"Do you like Mexican food? Cause I want to wrap you in my arms and make you my BAE-RITTO."},{"category":"tinder","line":"Are you made out of grapes? Because you are fine as wine!"},{"category":"tinder","line":"If you were a flower you’d be a damnnn-delion"},{"category":"tinder","line":"Blue eyes, red lips, pale face. So pretty. You look like the flag of France."},{"category":"tinder","line":"My mattress is a little hard. Would you like to help me break it in?"},{"category":"tinder","line":"Is there a rainbow today? I just found the treasure I’ve been searching for!"},{"category":"tinder","line":"I'm a freelance gynecologist. How long has it been since your last checkup?"},{"category":"tinder","line":"If you look that good in clothes, you must look even better out of them."},{"category":"tinder","line":"If I were to ask you out on a date, would your answer be the same as the answer to this question?"},{"category":"tinder","line":"If beauty were time, you'd be eternity"},{"category":"tinder","line":"Is your name Earl Grey? Because you look like a hot-tea!"},{"category":"tinder","line":"Since distance equals velocity times time, let's let velocity and time approach infinity, because I want to go all the way with you."},{"category":"disney","line":"Hey Aladdin, is that a lamp in your pocket or are you just happy to see me?"},{"category":"disney","line":"Hey Jasmine, Does the magic carpet match the drapes?"},{"category":"disney","line":"Hi, I'm Andy. Wanna play with my Woody?"},{"category":"disney","line":"I can make any fairy moan... All I need to do is Tink'er'bell."},{"category":"disney","line":"Hey Cinderella let's see if this fits!"},{"category":"disney","line":"Can you feel the love tonight?"},{"category":"disney","line":"I'll make you want to spend more time in bed with me than Sleeping, Beauty."},{"category":"disney","line":"Honestly, I just wanna get The Sword in the Stone!"},{"category":"disney","line":"Hi my name is Mickey, and there is nothing Minnie about me!"},{"category":"disney","line":"I’ll bippity bop you, girl!"},{"category":"disney","line":"Minnie, want to see my polka dot bed sheets?"},{"category":"disney","line":"You can call me Nemo, because I'm gonna \"touch the butt"},{"category":"disney","line":"Forget Aladdin, I'm thinking bout Jasmine's carpet."},{"category":"disney","line":"Things are much better down where it's wetter."}]